# High performance pandas

```py
mask = (x > .5) & (y < .5)
df[df[mask]]
```

under the hood

```py
tmp1 = (x > .5)
tmp2 = (y < .5)
mask = tmp1 & tmp2
```

use pd.eval(""), df.query() -> does elementwise operation with numexpr

In [1]:
import numpy as np
import pandas as pd

nrows, ncols = 1_000_000, 100


df1, df2, df3, df4 = [pd.DataFrame(np.random.randn(nrows, ncols)) for _ in range(4)]

In [2]:
df1.head()

,0,1,2,3,4,5,6,7,8,9,...,90,91,92,93,94,95,96,97,98,99
0,0.758790,0.428976,0.876100,0.648924,-1.245379,0.703341,0.358357,-0.922166,1.024502,-0.185921,...,-0.626261,1.067372,-1.985513,-1.144854,-0.015969,1.927471,-0.690275,-0.521301,0.018024,0.014103
1,-0.683373,0.437245,-1.819918,3.068762,-0.325847,0.024765,0.143581,-0.756906,0.256197,0.319433,...,0.150273,0.257178,0.814394,-0.326689,1.250011,0.800549,-1.608090,-0.294408,-1.855776,-0.594577
2,1.872862,-0.158461,-0.952048,-1.466380,-0.852329,1.043889,0.796028,0.480258,-0.916594,-1.805933,...,0.848445,-1.781009,0.461968,-1.139186,-0.821882,0.063628,-0.606137,-1.932822,1.578063,0.055009
3,-0.069153,0.164927,-1.044809,0.815231,-0.072033,1.021776,0.809910,1.829933,-1.057421,-1.124114,...,-1.525352,2.083603,-0.640214,-0.067034,0.538911,0.261455,-0.950418,-2.890841,-0.063749,0.101684
4,0.488456,-1.016522,0.679915,0.339560,-0.080416,-0.829124,0.773083,0.494341,0.110244,0.219027,...,0.831106,-1.799591,-0.608617,-1.412971,-0.327401,-0.971033,0.791994,-0.880544,-1.777365,-0.985082

In [3]:
df1.shape

(1000000, 100)

In [4]:
%timeit df1+df2+df3+df4

3.14 s ± 2.05 s per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [5]:
%timeit pd.eval("df1+df2+df3+df4")

1.96 s ± 81 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [6]:
standard = df1+df2+df3+df4
sum_eval = pd.eval("df1+df2+df3+df4")

sum_eval.equals(standard)

True

In [7]:
rolls = pd.DataFrame(np.random.randint(1,6, (6,3)), columns= ["Die1", "Die2", "Die3"])

rolls

   Die1  Die2  Die3
0     1     4     2
1     5     2     1
2     5     4     3
3     1     3     4
4     3     5     3
5     1     1     3

In [9]:
rolls.eval("Sum = Die1 + Die2 + Die3", inplace = True)

In [10]:
rolls

   Die1  Die2  Die3  Sum
0     1     4     2    7
1     5     2     1    8
2     5     4     3   12
3     1     3     4    8
4     3     5     3   11
5     1     1     3    5

In [12]:
high = 11
rolls.eval("Winner = Sum > @high")

   Die1  Die2  Die3  Sum  Winner
0     1     4     2    7   False
1     5     2     1    8   False
2     5     4     3   12    True
3     1     3     4    8   False
4     3     5     3   11   False
5     1     1     3    5   False

In [13]:
rolls[rolls["Sum"] > high]

   Die1  Die2  Die3  Sum
2     5     4     3   12

## Query

- filter using query

In [16]:
rolls.query("Sum > @high | Die1 == 1")

   Die1  Die2  Die3  Sum
0     1     4     2    7
2     5     4     3   12
3     1     3     4    8
5     1     1     3    5

In [ ]:
df_os = pd.read_csv("../Data/athlete_events.csv")